// Language Key-Text Mapping

const SPEECH_TO_TEXT = {
  bn: "Bangla",
  en: "English",
  gu: "Gujarati",
  hi: "Hindi",
  kn: "Kannada",
  ml: "Malayalam",
  mr: "Marathi",
  or: "Oriya",
  pa: "Panjabi",
  sa: "Sanskrit",
  ta: "Tamil",
  te: "Telugu",
  ur: "Urdu",
};

const TEXT_TO_SPEECH = {
  as: "Assamese",
  bn: "Bangla",
  brx: "Boro",
  en: "English",
  gu: "Gujarati",
  hi: "Hindi",
  kn: "Kannada",
  ml: "Malayalam",
  mni: "Manipuri (Meitei)",
  mni_Beng: "Manipuri (Bengali)",
  mr: "Marathi",
  or: "Oriya",
  pa: "Panjabi",
  raj: "Rajasthani",
  ta: "Tamil",
  te: "Telugu",
};

const TRANSLATION = {
  as: "Assamese",
  awa: "Awadhi",
  bho: "Bhojpuri",
  bn: "Bangla",
  brx: "Boro",
  doi: "Dogri",
  en: "English",
  gom: "Goan-Konkani",
  gu: "Gujarati",
  hi: "Hindi",
  hne: "Hindi-Eastern (Chhattisgarhi)",
  kn: "Kannada",
  ks: "Kashmiri (Arabic)",
  ks_Deva: "Kashmiri (Devanagari)",
  kha: "Khasi",
  lus: "Lushai (Mizo)",
  mag: "Magahi",
  mai: "Maithili",
  ml: "Malayalam",
  mni: "Manipuri (Meitei)",
  mni_Beng: "Manipuri (Bengali)",
  mr: "Marathi",
  ne: "Nepali",
  or: "Oriya",
  pa: "Panjabi",
  raj: "Rajasthani",
  sa: "Sanskrit",
  sat: "Santali",
  sd: "Sindhi (Arabic)",
  sd_Deva: "Sindhi (Devanagari)",
  si: "Sinhala",
  ta: "Tamil",
  te: "Telugu",
  ur: "Urdu",
};

const LANGUAGE_SELECTION = (code) => {
  let index = -1;
  switch (code) {
    case 'en':
      index = 1;
      break;
    case 'hi':
      index = 0;
      break;
    case 'as':
      index = 2;
      break;
    case 'bn':
      index = 3;
      break;
    case 'brx':
      index = 4;
      break;
    case 'doi':
      index = 5;
      break;
    case 'gom':
      index = 6;
      break;
    case 'gu':
      index = 7;
      break;
    case 'kn':
      index = 8;
      break;
    case 'ks':
      index = 9;
      break;
    case 'ks_Deva':
      index = 10;
      break;
    case 'mai':
      index = 11;
      break;
    case 'ml':
      index = 12;
      break;
    case 'mni':
      index = 13;
      break;
    case 'mni_Beng':
      index = 14;
      break;
    case 'mr':
      index = 15;
      break;
    case 'ne':
      index = 16;
      break;
    case 'or':
      index = 17;
      break;
    case 'pa':
      index = 18;
      break;
    case 'sa':
      index = 19;
      break;
    case 'sat':
      index = 20;
      break;
    case 'sd':
      index = 21;
      break;
    case 'sd_Deva':
      index = 22;
      break;
    case 'ta':
      index = 23;
      break;
    case 'te':
      index = 24;
      break;
    case 'ur':
      index = 25;
      break;
    default:
      index = 1;
      break;
  }
  return index;
}

const PREDEFINED_ANNOUNCEMENT = [
  {
    origination: 'यात्रीगण कृप्या ध्यान दीजिए, गाड़ी संख्या (train_no), (origin) से चलकर (destination) को जाने वाली, (train_name) कुछ ही देर मे प्लेटफॉर्म संख्या (PF) से चलने वाली है | ',
    arriving: 'यात्रीगण कृप्या ध्यान दीजिए, गाड़ी संख्या (train_no), (origin) से चलकर (destination) को जाने वाली, (train_name) कुछ ही देर मे प्लेटफॉर्म संख्या (PF) पर आ रही है |',
    arrived:'यात्रीगण कृप्या ध्यान दीजिए, गाड़ी संख्या (train_no), (origin) से चलकर (destination) को जाने वाली, (train_name) प्लेटफॉर्म संख्या (PF) पर खड़ी है| ',
    late:'यात्रीगण कृप्या ध्यान दीजिए, गाड़ी संख्या (train_no), (origin) से चलकर (destination) को जाने वाली, (train_name) अपने निर्धारित समय से (ghante) घंटे और (mintu) मिनट की देरी से चल रह है, इसके यहा (intime) बजे, प्लेटफॉर्म क्रमांक (PF) पर, आने की संभावना है|  ',
    ontime:'यात्रीगण कृप्या ध्यान दीजिए, गाड़ी संख्या (train_no), (origin) से चलकर (destination) को जाने वाली, (train_name) अपने निर्धारित समय से चल रही है, इसके यहा (intime) बजे, प्लेटफॉर्म क्रमांक (PF) पर, आने की संभावना है| ',
    additional:'यह ट्रेन (intime) पर आएगी और (stop) मिनट के बाद (outtime) पर प्रस्थान करेगी|',
    custom:'ट्रेन संख्या (train_no) (train_name) (late_time) मिनट की देरी से चल रही है । यह (next_station) पर प्लेटफार्म संख्या (PF) पर (intime) बजे पहुंचेगी और यहाँ (stop) मिनट के लिए ठहरेगी',
  },
  {
    origination: 'May I have your attention please, train number (train_no) from (origin) to (destination), (train_name) is about to depart from platform number (PF).',
    arriving: 'May I have your attention please, train number (train_no) from (origin) to (destination), (train_name) is arriving on platform number (PF) shortly.',
    arrived:'May I have your attention please, train number (train_no) from (origin) to (destination), (train_name) just arrived on platform number (PF).',
    late:'May I have your attention please, train number (train_no) from (origin) to (destination), (train_name), is running late by (ghante) hours and (mintu) minutes from its scheduled time, and is expected to arrive at (intime) on platform number (PF). ',
    ontime:'May I have your attention please, train number (train_no) from (origin) to (destination), (train_name), is running as scheduled, this train will reach platform number (PF) at its scheduled time at (intime).',
    additional:'This train will arrive on (intime) and will depart after (stop) minutes at (outtime).',
    custom:'Train number (train_no), the (train_name), is currently delayed by (late_time) minutes. It is expected to arrive at (Tatanagar Junction) on platform number (PF) at (intime) with a (stop) minutes scheduled halt.',
  },
  {
    additional:
      "এই ট্ৰেইনখন (15:50) ত আহিব আৰু (15:55) ত (5) মিনিটৰ পিছত প্রস্থান কৰিব।",
    arrived:
      "অনুগ্ৰহ কৰি মই আপোনাৰ দৃষ্টি আকৰ্ষণ কৰিব পাৰোঁ, (নতুন দিল্লী) ৰ পৰা (অমৃতসৰ) লৈ যোৱা ৰে 'ল নম্বৰ (12497), (ছান-ই-পঞ্জাব এক্সপ্ৰেছ) এইমাত্ৰ প্লেটফৰ্ম নম্বৰত (8) উপস্থিত হৈছে।",
    arriving:
      "অনুগ্ৰহ কৰি মই আপোনালোকৰ দৃষ্টি আকৰ্ষণ কৰিব পাৰোঁ, (নতুন দিল্লী) ৰ পৰা (অমৃতসৰ) লৈ যোৱা ৰে 'ল নম্বৰ (12497), (ছান-ই-পঞ্জাব এক্সপ্ৰেছ) অতি সোনকালেই প্লেটফৰ্ম নম্বৰ (8) ত আহিব।",
    code: "as",
    custom:
      "ট্ৰেইন নম্বৰ (13287), (দক্ষিণ বিহাৰ এক্সপ্ৰেছ), বৰ্তমান (30) মিনিট পলম হৈছে। ই প্লেটফৰ্ম নম্বৰ (1) ত (19:00) (15) মিনিটৰ নিৰ্ধাৰিত অৱস্থানৰ সৈতে (টাটানগৰ জংচন) ত উপস্থিত হ 'ব বুলি আশা কৰা হৈছে।",
    late: "অনুগ্ৰহ কৰি মই আপোনাৰ দৃষ্টি আকৰ্ষণ কৰিব পাৰোঁনে, (নতুন দিল্লী) ৰ পৰা (অমৃতসৰ), (ছান-ই-পঞ্জাব এক্সপ্ৰেছ) লৈ যোৱা ৰে 'ল নম্বৰ (12497), নিৰ্ধাৰিত সময়ৰ পৰা (5) ঘণ্টা আৰু (25) মিনিট পলমকৈ চলি আছে, আৰু প্লেটফৰ্ম নম্বৰ (4) ত (20:00) পোৱাৰ আশা কৰা হৈছে।",
    ontime:
      "অনুগ্ৰহ কৰি মই আপোনালোকৰ দৃষ্টি আকৰ্ষণ কৰিব পাৰোঁনে, (নতুন দিল্লী) ৰ পৰা (অমৃতসৰ) (ছান-ই-পঞ্জাব এক্সপ্ৰেছ) লৈ যোৱা ৰে 'ল নম্বৰ (12497), সময়সূচী অনুসৰি চলি আছে, এই ৰে' লখনে ইয়াৰ নিৰ্ধাৰিত সময়ত (17:00) প্লেটফৰ্ম নম্বৰ (5) ত উপনীত হ 'ব।",
    origination:
      "অনুগ্ৰহ কৰি মই আপোনালোকৰ দৃষ্টি আকৰ্ষণ কৰিব পাৰোঁ, ট্ৰেইন নম্বৰ (12497) (নতুন দিল্লী) ৰ পৰা (অমৃতসৰ), (ছান-ই-পঞ্জাব এক্সপ্ৰেছ) প্লেটফৰ্ম নম্বৰ (14) ৰ পৰা প্ৰস্থান কৰিবলৈ গৈ আছে।",
  },
  {
    additional:
      "এই ট্রেনটি (15:50)-এ পৌঁছবে এবং (15:55)-এ (5) মিনিট পর ছেড়ে যাবে।",
    arrived:
      "দয়া করে আপনার দৃষ্টি আকর্ষণ করছি, (নয়াদিল্লি) থেকে (অমৃতসর) যাওয়ার ট্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) সবেমাত্র প্ল্যাটফর্ম নম্বর (8)-এ এসেছে।",
    arriving:
      "দয়া করে আপনার দৃষ্টি আকর্ষণ করি, (নয়াদিল্লি) থেকে (অমৃতসর) যাওয়ার ট্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) শীঘ্রই প্ল্যাটফর্ম নম্বর (8)-এ আসছে।",
    code: "bn",
    custom:
      "ট্রেন নম্বর (13287), (দক্ষিণ বিহার এক্সপ্রেস), বর্তমানে (30) মিনিট বিলম্বিত হচ্ছে। এটি (15) মিনিটের নির্ধারিত বিরতি সহ (1) নম্বর প্ল্যাটফর্মে (19:00) (টাটানগর জংশন) পৌঁছবে বলে আশা করা হচ্ছে।",
    late: "দয়া করে আপনার দৃষ্টি আকর্ষণ করি, (নয়াদিল্লি) থেকে (অমৃতসর) যাওয়ার ট্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) নির্ধারিত সময় থেকে (5) ঘন্টা (25) মিনিট দেরি করছে, এবং প্ল্যাটফর্ম নম্বর (4)-এ (20:00) পৌঁছবে বলে আশা করা হচ্ছে।",
    ontime:
      "আমি কি দয়া করে আপনাদের দৃষ্টি আকর্ষণ করতে পারি, ট্রেন নম্বর (12497) (নয়াদিল্লি) থেকে (অমৃতসর), (শান-ই-পাঞ্জাব এক্সপ্রেস), নির্ধারিত সময়সূচী অনুযায়ী চলছে, এই ট্রেনটি তার নির্ধারিত সময়ে (17:00) প্ল্যাটফর্ম নম্বর (5) এ পৌঁছাবে।",
    origination:
      "দয়া করে আপনার দৃষ্টি আকর্ষণ করি, (নয়াদিল্লি) থেকে (অমৃতসর) যাওয়ার ট্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) প্ল্যাটফর্ম নম্বর (14) থেকে ছাড়তে চলেছে।",
  },

  {
    additional:
      "बे ट्रेना (15:50) आव सौगोन आरो (5) मिनिटनि उनाव (15:55) आव ओंखारगोन।",
    arrived:
      "अन्नानै आं नोंथांखौ नोजोर होनो हागोन नामा, (गोदान दिल्ली) निफ्राय (अमृतसर) सिम ट्रेन नम्बर (12497), (शान-ए-पंजाब एक्सप्रेस) प्लेटफर्म नम्बर (8) आव सफैबाय।",
    arriving:
      "आं अन्नानै नोंनि गोसोखौ लानो हायो, (गोदान दिल्ली) निफ्राय (अमृतसर) सिम ट्रेन नम्बर (12497), (शान-ए-पंजाब एक्सप्रेस) प्लेटफर्म नम्बर (8) आव थाबैनो सौफैगासिनो।",
    code: "brx",
    custom: "'्रेन नम्बर (13287), (खोला बिहार एक्सप्रेस) आ आथिखालाव (30) मिनिट गोबाव जादों। बेखौ प्लेटफर्म नम्बर (1) आव (19:00) (15) मिनिटनि थि थाद 'नायजों (टाटानगर जंक्शन) सौफैनायनि आसा दं।'",
    late: "अन्नानै आं नोंनि गोसोखौ नायनो हागोन नामा, (गोदान दिल्ली) निफ्राय (अमृतसर) सिम ट्रेन नम्बर (12497), (शान-ए-पंजाब एक्सप्रेस), गावनि थि समनिफ्राय (5) घन्टा आरो (25) मिनिट गोबावै खारगासिनो, आरो प्लेटफर्म नम्बर (4) आव (20:00) सौहैनायनि आसा दं।",
    ontime:
      "(गोदान दिल्ली) निफ्राय (अमृतसर) सिम ट्रेन नम्बर (12497), (शान-ए-पंजाब एक्सप्रेस), थि सम बायदियै खारगासिनो, बे ट्रेनआ प्लेटफर्म नम्बर (5) आव गावनि थि समाव (17:00) सौहैगोन।",
    origination:
      "आं अन्नानै नोंनि गोसोखौ लानो हायो, (गोदान दिल्ली) निफ्राय (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) ट्रेन नम्बर (12497) आ प्लेटफर्म नम्बर (14) निफ्राय ओंखारनो हमगासिनो।",
  },
  {
    additional:
      "एह् रेलगड्डी (15:50) पर औग ते (5) मिंटें परैंत्त (15:55) पर रवाना होग।",
    arrived:
      "कृपा करियै में तुंʼदा ध्यान देई सकनां, रेलगड्डी नंबर (12497) (नमीं दिल्ली) थमां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफार्म नंबर (8) पर आई ऐ।",
    arriving:
      "कृपा करियै में तुंʼदा ध्यान देई सकनां, रेलगड्डी नंबर (12497) (नमीं दिल्ली) थमां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफार्म नंबर (8) पर तुंʼदी गै औने आह्ली ऐ।",
    code: "doi",
    custom: 'ट्रेन नंबर (13287), (दक्खन बिहार एक्सप्रेस), वर्तमान च (30) मिंटें दी देरी कन्नै चलदी ऐ। एह्दे प्लेटफार्म नंबर (1) पर (19:00) (15) मिंटें दे निर्धारित विराम दे कन्नै (टाटानगर जंक्शन) औने दी मेद ऐ।',
    late: "कृपा करियै में तुंʼदा ध्यान देई सकनां, (नमीं दिल्ली) थमां (अमृतसर) जाने आह्ली रेलगड्डी (12497), (शान-ए-पंजाब एक्सप्रेस), अपने निर्धारित समें थमां (5) घैंटे ते (25) मिंट लेट चला दी ऐ, ते प्लेटफार्म नंबर (4) पर (20:00) तक्कर औने दी मेद ऐ।",
    ontime:
      "कृपा करियै में तुंʼदा ध्यान देई सकनां, (नमीं दिल्ली) थमां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) तक्कर जाने आह्ली रेलगड्डी नंबर (12497), निर्धारित समें दे मताबक चलदी ऐ, एह् रेलगड्डी अपने निर्धारित समें (17:00) पर प्लेटफार्म नंबर (5) तक्कर पुजग।",
    origination:
      "कृपा करियै में तुंʼदा ध्यान देई सकनां, रेलगड्डी नंबर (12497) (नमीं दिल्ली) थमां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफार्म नंबर (14) थमां रवाना होने आह्ली ऐ।",
  },
  {
    additional:
      "ही ट्रेन (15:50) चेर येतली आनी (5) मिण्टां उपरांत (15:55) भायर वतली.",
    arrived:
      "उपकार करून हांव तुजें लक्ष दिवंक शकता, (नवी दिल्ली) सावन (अमृतसर) वचपी रेल्वे क्रमांक (12497), (शान-ए-पंजाब एक्सप्रेस) आतांच प्लॅटफॉर्म क्रमांकाचेर (8) पावला.",
    arriving:
      "उपकार करून हांव तुजें लक्ष दिवंक शकता, (नवी दिल्ली) सावन (अमृतसर) वचपी रेल्वे क्रमांक (12497), (शान-ए-पंजाब एक्सप्रेस) बेगीनच प्लॅटफॉर्म क्रमांकाचेर (8) पावता.",
    code: "gom",
    custom:
      "ट्रेन क्रमांक (13287), (दक्षिण बिहार एक्सप्रेस), सद्या (30) मिनटां उसरां वता. प्लॅटफॉर्म क्रमांक (1) चेर (19:00) (15) मिनटांचो थारावीक थांबो घेवन (टाटानगर जंक्शन) पावपाची अपेक्षा आसा.",
    late: "उपकार करून हांव तुजें लक्ष दिवंक शकता, (नवी दिल्ली) सावन (अमृतसर) वचपी रेल्वे क्रमांक (12497), (शान-ए-पंजाब एक्सप्रेस), थारायिल्ल्या वेळा सावन (5) वरां आनी (25) मिनटां उसरां वता, आनी प्लॅटफॉर्म क्रमांक (4) चेर (20:00) पावपाची अपेक्षा आसा.",
    ontime:
      "उपकार करून हांव तुजें लक्ष दिवंक शकता, (नवी दिल्ली) सावन (अमृतसर) वचपी रेल्वे क्रमांक (12497), (शान-ए-पंजाब एक्स्प्रेस), वेळापत्रका प्रमाण चलता, ही रेल्वे आपल्या थारायिल्ल्या वेळार (17:00) प्लॅटफॉर्म क्रमांक (5) चेर पावटली.",
    origination:
      "उपकार करून हांव तुजें लक्ष दिवंक शकता, (नवी दिल्ली) सावन (अमृतसर) वचपी रेल्वे क्रमांक (12497), (शान-ए-पंजाब एक्सप्रेस) प्लॅटफॉर्म क्रमांक (14) सावन भायर सरपाची आसा.",
  },
  {
    additional:
      "આ ટ્રેન (15:50) પર પહોંચશે અને (15:55) પર (5) મિનિટ પછી ઉપડશે.",
    arrived:
      "કૃપા કરીને હું તમારું ધ્યાન દોરું, (નવી દિલ્હી) થી (અમૃતસર) (શાન-એ-પંજાબ એક્સપ્રેસ) ટ્રેન નંબર (12497) હમણાં જ પ્લેટફોર્મ નંબર (8) પર આવી છે.",
    arriving:
      "કૃપા કરીને હું તમારું ધ્યાન દોરું, (નવી દિલ્હી) થી (અમૃતસર) (શાન-એ-પંજાબ એક્સપ્રેસ) સુધીની ટ્રેન નંબર (12497) ટૂંક સમયમાં પ્લેટફોર્મ નંબર (8) પર આવી રહી છે.",
    code: "gu",
    custom: '્રેન નંબર (13287), (દક્ષિણ બિહાર એક્સપ્રેસ), હાલમાં (30) મિનિટ વિલંબિત છે. તે (15) મિનિટના નિર્ધારિત વિરામ સાથે (19:00) પ્લેટફોર્મ નંબર (1) પર (ટાટાનગર જંક્શન) પહોંચવાની અપેક્ષા છે.',
    late: "કૃપા કરીને હું તમારું ધ્યાન દોરું, (નવી દિલ્હી) થી (અમૃતસર) (શાન-એ-પંજાબ એક્સપ્રેસ) સુધીની ટ્રેન નંબર (12497), તેના નિર્ધારિત સમયથી (5) કલાક અને (25) મિનિટ મોડી ચાલી રહી છે, અને પ્લેટફોર્મ નંબર (4) પર (20:00) પહોંચવાની અપેક્ષા છે.",
    ontime:
      "કૃપા કરીને હું તમારું ધ્યાન દોરું, (નવી દિલ્હી) થી (અમૃતસર) (શાન-એ-પંજાબ એક્સપ્રેસ) સુધીની ટ્રેન નંબર (12497) નિર્ધારિત સમય મુજબ ચાલી રહી છે, આ ટ્રેન તેના નિર્ધારિત સમયે (17:00) પ્લેટફોર્મ નંબર (5) પર પહોંચશે.",
    origination:
      "કૃપા કરીને હું તમારું ધ્યાન દોરું, ટ્રેન નંબર (12497) (નવી દિલ્હી) થી (અમૃતસર), (શાન-એ-પંજાબ એક્સપ્રેસ) પ્લેટફોર્મ નંબર (14) થી ઉપડવાની છે.",
  },
  {
    additional:
      "ಈ ರೈಲು (15:50) ತಲುಪುತ್ತದೆ ಮತ್ತು (5) ನಿಮಿಷಗಳ ನಂತರ (15:55) ಹೊರಡುತ್ತದೆ.",
    arrived:
      "ದಯವಿಟ್ಟು ನಿಮ್ಮ ಗಮನವನ್ನು ಸೆಳೆಯಲಿ, ರೈಲು ಸಂಖ್ಯೆ (12497) (ನವದೆಹಲಿ) ಯಿಂದ (ಅಮೃತಸರ), (ಶಾನ್-ಎ-ಪಂಜಾಬ್ ಎಕ್ಸ್ಪ್ರೆಸ್) ಈಗಷ್ಟೇ ಪ್ಲಾಟ್ಫಾರ್ಮ್ ಸಂಖ್ಯೆ (8) ತಲುಪಿದೆ.",
    arriving:
      "ದಯವಿಟ್ಟು ನಾನು ನಿಮ್ಮ ಗಮನವನ್ನು ಸೆಳೆಯಲಿ, ರೈಲು ಸಂಖ್ಯೆ (12497) (ನವದೆಹಲಿ) ಯಿಂದ (ಅಮೃತಸರ), (ಶಾನ್-ಎ-ಪಂಜಾಬ್ ಎಕ್ಸ್ಪ್ರೆಸ್) ಶೀಘ್ರದಲ್ಲೇ ಪ್ಲಾಟ್ಫಾರ್ಮ್ ಸಂಖ್ಯೆ (8) ಗೆ ಆಗಮಿಸುತ್ತಿದೆ.",
    code: "kn",
    custom: ' ರೈಲು ಸಂಖ್ಯೆ (13287), (ದಕ್ಷಿಣ ಬಿಹಾರ ಎಕ್ಸ್ಪ್ರೆಸ್), ಪ್ರಸ್ತುತ (30) ನಿಮಿಷಗಳಷ್ಟು ವಿಳಂಬವಾಗಿದೆ. ಇದು (15) ನಿಮಿಷಗಳ ನಿಗದಿತ ನಿಲುಗಡೆಯೊಂದಿಗೆ (19:00) ಪ್ಲಾಟ್ಫಾರ್ಮ್ ಸಂಖ್ಯೆ (1) ನಲ್ಲಿ (ಟಾಟಾನಗರ ಜಂಕ್ಷನ್) ತಲುಪುವ ನಿರೀಕ್ಷೆಯಿದೆ.',
    late: "ದಯವಿಟ್ಟು ನಾನು ನಿಮ್ಮ ಗಮನವನ್ನು ಸೆಳೆಯಲಿ, ರೈಲು ಸಂಖ್ಯೆ (12497) (ನವದೆಹಲಿ) ದಿಂದ (ಅಮೃತಸರ), (ಶಾನ್-ಎ-ಪಂಜಾಬ್ ಎಕ್ಸ್ಪ್ರೆಸ್), ನಿಗದಿತ ಸಮಯದಿಂದ (5) ಗಂಟೆಗಳು ಮತ್ತು (25) ನಿಮಿಷಗಳಷ್ಟು ತಡವಾಗಿ ಚಲಿಸುತ್ತಿದೆ ಮತ್ತು ಪ್ಲಾಟ್ಫಾರ್ಮ್ ಸಂಖ್ಯೆ (4) ನಲ್ಲಿ (20:00) ತಲುಪುವ ನಿರೀಕ್ಷೆಯಿದೆ.",
    ontime:
      "ದಯವಿಟ್ಟು ನಾನು ನಿಮ್ಮ ಗಮನವನ್ನು ಸೆಳೆಯಲಿ, ರೈಲು ಸಂಖ್ಯೆ (12497) (ನವದೆಹಲಿ) ಯಿಂದ (ಅಮೃತಸರ), (ಶಾನ್-ಎ-ಪಂಜಾಬ್ ಎಕ್ಸ್ಪ್ರೆಸ್), ನಿಗದಿತ ವೇಳಾಪಟ್ಟಿಯಂತೆ ಓಡುತ್ತಿದೆ, ಈ ರೈಲು ತನ್ನ ನಿಗದಿತ ಸಮಯದಲ್ಲಿ (17:00) ಪ್ಲಾಟ್ಫಾರ್ಮ್ ಸಂಖ್ಯೆ (5) ಅನ್ನು ತಲುಪುತ್ತದೆ.",
    origination:
      "ದಯವಿಟ್ಟು ನಾನು ನಿಮ್ಮ ಗಮನವನ್ನು ಸೆಳೆಯಲಿ, ರೈಲು ಸಂಖ್ಯೆ (12497) (ನವದೆಹಲಿ) ಯಿಂದ (ಅಮೃತಸರ), (ಶಾನ್-ಎ-ಪಂಜಾಬ್ ಎಕ್ಸ್ಪ್ರೆಸ್) ಪ್ಲಾಟ್ಫಾರ್ಮ್ ಸಂಖ್ಯೆ (14) ಯಿಂದ ಹೊರಡಲಿದೆ.",
  },
  {
    additional:
      "یہ ٹرین آسہٕ (15:50) پؠٹھ تہٕ گژھن (5) منٹن پتہٕ (15:55) پؠٹھ۔",
    arrived:
      "بہٕ ہؠکا مہربٲنی کٔرتھ تہنٛد توجہ دتھ، ٹرین نمبر (12497) (نیہ دلہ) پؠٹھٕ (امرتسر)، (شان پنجاب ایکسپریس) ووت صرف پلیٹ فارم نمبرس (8) پؠٹھ۔",
    arriving:
      "بہٕ ہؠکا مہربٲنی کٔرتھ تہنٛد توجہ دتھ، ٹرین نمبر (12497) (نیہ دلہ) پؠٹھٕ (امرتسر)، (شان پنجاب ایکسپریس) چھ جلدی پلیٹ فارم نمبرس (8) پؠٹھ یوان۔",
    code: "ks",
    custom: 'ٹرین نمبر (13287)، (ساؤتھ بہار ایکسپریس)، چھ وٕنکیٚنس (30) منٹ تاخیرس منٛز۔ یہ چھٗ پلیٹ فارم نمبرس (1) پیٹھ (19:00) پیٹھ (15) منٹن ہند مقرر رکنس سٕتہ (ٹاٹا نگر جنکشن) تام واتنٗک امکان۔',
    late: "بہٕ ہیٚکا مہربٲنی کٔرتھ تہنٛد توجہ دتھ، ٹرین نمبر (12497) (نیہ دلہ) پؠٹھٕ (امرتسر)، (شان-ای-پنجاب ایکسپریس)، چھ پننس مقرر وقتہٕ پیٚٹھٕ (5) گھنٛٹہٕ تہٕ (25) منٹ دیر سان پکان، تہٕ پلیٹ فارم نمبرس (4) پؠٹھ چھ (20:00) تام واتنٕچ توقع۔",
    ontime:
      "بہٕ ہیٚکا مہربٲنی کٔرتھ تہنٛد توجہ دتھ، ٹرین نمبر (12497) (نیہ دلہ) پؠٹھٕ (امرتسر)، (شان پنجاب ایکسپریس)، چھےٚ مقرر وقتہٕ مطٲبق پکان، یہ ٹرین واتہ پلیٹ فارم نمبر (5) پننس مقرر وقتس پؠٹھ (17:00)۔",
    origination:
      "بہٕ ہؠکا مہربٲنی کٔرتھ تہنٛد توجہ دتھ، ٹرین نمبر (12497) (نیہ دلہ) پؠٹھٕ (امرتسر)، (شان پنجاب ایکسپریس) چھ پلیٹ فارم نمبر (14) پؠٹھٕ گژھن وول۔",
  },
  {
    additional: "ये ट्रेन औ (15:50) ते रटन (5) मिनट्स पथ (15:55).",
    arrived:
      "ट्रेन नंबर (12497) (नई दिल्ली) से (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) बस प्लेटफार्म नंबर (8) पे आया.",
    arriving:
      "ट्रेन नंबर (12497) (नई दिल्ली) पेठ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफॉर्म नंबर (8) पेठ जल्द आ रही है।",
    code: "ks_Deva",
    custom: 'ट्रेन नंबर (13287), (साउथ बिहार एक्सप्रेस), वर्तमान में (30) मिनट लेट है। इ छी आसा (टाटानगर जंक्शन) प्लेटफार्म नंबर (1) पेठ (19:00) (15) मिनट्स शिड्यूल हाल्ट सेथ',
    late: "ट्रेन नंबर (12497) (नई दिल्ली) पेठ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस), छू लेट गासन (5) घंटे ते (25) मिनट टाइम सेत, ते प्लैटफॉर्म नंबर (4) पेठ (20:00).",
    ontime:
      "ट्रेन नंबर (12497) (नई दिल्ली) से (अमृतसर), (शान-ए-पंजाब एक्सप्रेस), शिड्यूल के मुताबिक चल रही है, ये ट्रेन प्लेटफॉर्म नंबर (5) अपने शिड्यूल टाइम पर (17:00) पहुंचेगी।",
    origination:
      "ट्रेन नंबर (12497) (नई दिल्ली) पेठ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफॉर्म नंबर (14) पेठ रटन वाली.",
  },
  {
    additional:
      "ई ट्रेन (15:50) पर पहुँचेगी आ (5) मिनटक बाद (15:55) पर रवाना होयत।",
    arrived:
      "कृपया हम अहाँ के ध्यान दऽ सकय छी, ट्रेन नंबर (12497) (नई दिल्ली) सँ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफॉर्म नंबर (8) पर आयल अछि।",
    arriving:
      "कृपया हम अहाँ के ध्यान दऽ सकय छी, ट्रेन नंबर (12497) (नई दिल्ली) सँ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) जल्दहि प्लेटफार्म नंबर (8) पर आबि रहल अछि।",
    code: "mai",
    custom:
      "ट्रेन नम्बर (13287), (दक्षिण बिहार एक्सप्रेस), वर्तमानमे (30) मिनट देरीसँ चलि रहल अछि। एकर प्लेटफॉर्म नंबर (1) पर (19:00) (15) मिनटक निर्धारित विरामक संग (टाटानगर जंक्शन) पहुँचबाक उम्मीद छैक।",
    late: "कृपया हम अहाँ के ध्यान दऽ सकय छी, ट्रेन नंबर (12497) (नई दिल्ली) सँ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस), अपन निर्धारित समय सँ (5) घंटा आ (25) मिनट देरी सँ चलि रहल अछि, आ प्लेटफॉर्म नंबर (4) पर (20:00) पर पहुँचय के उम्मीद अछि।",
    ontime:
      "कृपया हम अहाँ के ध्यान दऽ सकय छी, ट्रेन नंबर (12497) (नई दिल्ली) सँ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस), निर्धारित समय पर चलि रहल अछि, ई ट्रेन प्लेटफॉर्म नंबर (5) पर अपन निर्धारित समय पर (17:00) पहुंचतै।",
    origination:
      "कृपया हम अहाँ के ध्यान दऽ सकय छी, ट्रेन नंबर (12497) (नई दिल्ली) सँ (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफार्म नंबर (14) सँ प्रस्थान करय वाला छै।",
  },
  {
    additional:
      "ഈ ട്രെയിൻ (15:50) എത്തിച്ചേരുകയും (5) മിനിറ്റിനുശേഷം (15:55) പുറപ്പെടുകയും ചെയ്യും.",
    arrived:
      "(ന്യൂഡൽഹി) മുതൽ (അമൃത്സർ) വരെയുള്ള (ഷാൻ-ഇ-പഞ്ചാബ് എക്സ്പ്രസ്) ട്രെയിൻ നമ്പർ (12497) പ്ലാറ്റ്ഫോം നമ്പറിൽ (8) എത്തിയതേയുള്ളൂ.",
    arriving:
      "(ന്യൂഡൽഹി) മുതൽ (അമൃത്സർ) വരെയുള്ള (ഷാൻ-ഇ-പഞ്ചാബ് എക്സ്പ്രസ്) ട്രെയിൻ നമ്പർ (12497) താമസിയാതെ പ്ലാറ്റ്ഫോം നമ്പറിൽ (8) എത്തുന്നു.",
    code: "ml",
    custom: 'ട്രെയിൻ നമ്പർ (13287), (സൌത്ത് ബീഹാർ എക്സ്പ്രസ്), നിലവിൽ (30) മിനിറ്റ് വൈകുന്നു. പ്ലാറ്റ്ഫോം നമ്പർ (1) ൽ (19:00) (15) മിനിറ്റ് ഷെഡ്യൂൾ ചെയ്ത സ്റ്റോപ്പോടെ ഇത് (ടാറ്റാനഗർ ജംഗ്ഷനിൽ) എത്തുമെന്ന് പ്രതീക്ഷിക്കുന്നു.',
    late: "(ന്യൂഡൽഹി) മുതൽ (അമൃത്സർ) വരെയുള്ള ട്രെയിൻ നമ്പർ (12497), (ഷാൻ-ഇ-പഞ്ചാബ് എക്സ്പ്രസ്), നിശ്ചയിച്ച സമയത്തിൽ നിന്ന് (5) മണിക്കൂറും (25) മിനിറ്റും വൈകിയാണ് ഓടുന്നത്, കൂടാതെ പ്ലാറ്റ്ഫോം നമ്പർ (4) ൽ (20:00) എത്തുമെന്ന് പ്രതീക്ഷിക്കുന്നു.",
    ontime:
      "(ന്യൂഡൽഹി) മുതൽ (അമൃത്സർ) വരെയുള്ള (ഷാൻ-ഇ-പഞ്ചാബ് എക്സ്പ്രസ്) ട്രെയിൻ നമ്പർ (12497) നിശ്ചയിച്ച പ്രകാരം ഓടുന്നു, ഈ ട്രെയിൻ നിശ്ചയിച്ച സമയത്ത് (17:00) പ്ലാറ്റ്ഫോം നമ്പർ (5) ൽ എത്തും.",
    origination:
      "(ന്യൂഡൽഹി) മുതൽ (അമൃത്സർ) വരെയുള്ള (ഷാൻ-ഇ-പഞ്ചാബ് എക്സ്പ്രസ്) ട്രെയിൻ നമ്പർ (12497) പ്ലാറ്റ്ഫോം നമ്പറിൽ (14) നിന്ന് പുറപ്പെടാൻ പോകുന്നു.",
  },
  {
    additional:
      "ꯇ ꯭ ꯔꯦꯟ ꯑꯁꯤ (15:50) ꯗ ꯂꯥꯛꯀꯅꯤ ꯑꯃꯁꯨꯡ (15:55) ꯗ ꯃꯤꯅꯤꯠ (5) ꯒꯤ ꯃꯇꯨꯡꯗ ꯊꯥꯗꯣꯛꯀꯅꯤ ꯫",
    arrived:
      "ꯆꯥꯟꯕꯤꯗꯨꯅ ꯑꯗꯣꯝꯒꯤ ꯄꯨꯛꯅꯤꯡ ꯆꯤꯡꯁꯤꯟꯕꯤꯔꯛꯎ, (ꯅ ꯭ ꯌꯨ ꯗꯤꯜꯂꯤ) ꯗꯒꯤ (ꯑꯝꯔꯤꯠꯁꯔ) ꯐꯥꯎꯕꯒꯤ ꯇ ꯭ ꯔꯦꯟ ꯅꯝꯕꯔ (12497), (ꯁꯥꯟ-ꯏ-ꯄꯟꯖꯥꯕ ꯑꯦꯛꯁꯄ ꯭ ꯔꯦꯁ) ꯑꯁꯤ ꯄ ꯭ ꯂꯦꯠꯐꯣꯔ ꯭ ꯝ ꯅꯝꯕꯔ (8) ꯗ ꯂꯥꯛꯈ ꯭ ꯔꯦ ꯫",
    arriving:
      "ꯆꯥꯟꯕꯤꯗꯨꯅ ꯑꯗꯣꯝꯒꯤ ꯄꯨꯛꯅꯤꯡ ꯆꯤꯡꯁꯤꯟꯕꯤꯔꯛꯎ, (ꯅ ꯭ ꯌꯨ ꯗꯤꯜꯂꯤ) ꯗꯒꯤ (ꯑꯝꯔꯤꯠꯁꯔ) ꯐꯥꯎꯕꯒꯤ ꯇ ꯭ ꯔꯦꯟ ꯅꯝꯕꯔ (12497), (ꯁꯥꯟ-ꯏ-ꯄꯟꯖꯥꯕ ꯑꯦꯛꯁꯄ ꯭ ꯔꯦꯁ) ꯑꯁꯤ ꯊꯨꯅ ꯄ ꯭ ꯂꯦꯠꯐꯣꯔꯝ ꯅꯝꯕꯔ (8) ꯗ ꯂꯥꯛꯂꯤ ꯫",
    code: "mni",
    custom: undefined,
    late: "ꯆꯥꯟꯕꯤꯗꯨꯅ ꯑꯗꯣꯝꯒꯤ ꯄꯨꯛꯅꯤꯡ ꯆꯤꯡꯁꯤꯟꯕꯤꯔꯛꯎ, (ꯅ ꯭ ꯌꯨ ꯗꯤꯜꯂꯤ) ꯗꯒꯤ (ꯑꯝꯔꯤꯠꯁꯔ) ꯐꯥꯎꯕꯒꯤ ꯇ ꯭ ꯔꯦꯟ ꯅꯝꯕꯔ (12497), (ꯁꯥꯟ-ꯏ-ꯄꯟꯖꯥꯕ ꯑꯦꯛ ꯭ ꯁꯄ ꯭ ꯔꯦꯁ) ꯑꯁꯤ ꯂꯦꯞꯈꯤꯕ ꯃꯇꯝꯗꯒꯤ ꯄꯨꯡ (5) ꯑꯃꯁꯨꯡ ꯃꯤꯅꯤꯠ (25) ꯋꯥꯠꯂꯤ, ꯑꯃꯁꯨꯡ ꯄ ꯭ ꯂꯦꯠꯐꯣꯔꯝ ꯅꯝꯕꯔ (4) ꯗ (<ꯑꯥꯏ. ꯗꯤ. 1>) ꯌꯧꯔꯛꯀꯅꯤ ꯍꯥꯏꯅ ꯄꯥꯅꯔꯤ ꯫",
    ontime:
      "ꯆꯥꯟꯕꯤꯗꯨꯅ ꯑꯗꯣꯝꯒꯤ ꯄꯨꯛꯅꯤꯡ ꯆꯤꯡꯁꯤꯟꯕꯤꯔꯛꯎ, (ꯅ ꯭ ꯌꯨ ꯗꯤꯜꯂꯤ) ꯗꯒꯤ (ꯑꯝꯔꯤꯠꯁꯔ) ꯐꯥꯎꯕꯒꯤ ꯇ ꯭ ꯔꯦꯟ ꯅꯝꯕꯔ (12497), (ꯁꯥꯟ-ꯏ-ꯄꯟꯖꯥꯕ ꯑꯦꯛ ꯭ ꯁꯄ ꯭ ꯔꯦꯁ) ꯑꯁꯤ ꯃꯇꯝ ꯂꯦꯞꯈꯤꯕꯒꯨꯝꯅ ꯆꯂꯥꯏꯔꯤ, ꯇ ꯭ ꯔꯦꯟ ꯑꯁꯤ ꯃꯁꯤꯒꯤ ꯃꯇꯝ ꯂꯦꯞꯈꯤꯕ ꯃꯇꯝꯗ (<ꯑꯥꯏ. ꯗꯤ. 1>) ꯄ ꯭ ꯂꯦꯠꯐꯣꯔ ꯭ ꯝ ꯅꯝꯕꯔ (5) ꯌꯧꯒꯅꯤ ꯫",
    origination:
      "ꯆꯥꯟꯕꯤꯗꯨꯅ ꯑꯗꯣꯝꯒꯤ ꯄꯨꯛꯅꯤꯡ ꯆꯤꯡꯁꯤꯟꯕꯤꯔꯛꯎ, (ꯅ ꯭ ꯌꯨ ꯗꯤꯜꯂꯤ) ꯗꯒꯤ (ꯑꯝꯔꯤꯠꯁꯔ) ꯐꯥꯎꯕꯒꯤ ꯇ ꯭ ꯔꯦꯟ ꯅꯝꯕꯔ (12497), (ꯁꯥꯟ-ꯏ-ꯄꯟꯖꯥꯕ ꯑꯦꯛꯁꯄ ꯭ ꯔꯦꯁ) ꯑꯁꯤ ꯄ ꯭ ꯂꯦꯠꯐꯣꯔ ꯭ ꯝ ꯅꯝꯕꯔ (14) ꯗꯒꯤ ꯊꯥꯗꯣꯛꯀꯗꯧꯔꯤ ꯫",
  },
  {
    additional:
      "হায়রিবা ত্রেন অসি (15:50) দা লাক্কনি অমসুং (15:55) দা মিনিট 5গী মতুংদা চৎকনি।",
    arrived:
      "(নই দিল্লী) দগী (অমৃতসর) ফাওবা চৎলিবা ত্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) অসি প্লেতফোর্ম নম্বর (8) দা লাকখ্রে।",
    arriving:
      "(ন্যু দিল্লী) দগী (অমৃতসর) ফাওবা চৎলিবা ত্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) অসি প্লেতফোর্ম নম্বর (8) দা অথুবা মতমদা লাক্কনি।",
    code: "mni_Beng",
    custom: 'ত্রেন নম্বর (13287), (সাউথ বিহার এক্সপ্রেস) অসি হৌজিক মিনিৎ 30 হেন্না লেপখ্রে। মসি প্লেতফোর্ম নম্বর (1) দা (19:00) মিনিট 15 লেপতুনা (টাটানগর জঙ্কসন) য়ৌগনি হায়না থাজনরি।',
    late: "(ন্যু দিল্লী) দগী (অম্রিতসর) ফাওবা চৎলিবা ত্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) অসি মসিগী অকক্নবা মতমদগী পুং (5) অমসুং মিনিট (25) হেন্না লেপখ্রে, অমসুং প্লেতফোর্ম নম্বর (4) দা (20:00) য়ৌগনি।",
    ontime:
      "(ন্যু দিল্লী) দগী (অম্রিতসর) ফাওবা চৎলিবা ত্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) অসি শিন্দোল তৌবগুম্না চেল্লি, মসিগী ত্রেন অসি মসিগী শিন্দোল থোক্লিবা মতম অদুদা (17:00) প্লেতফোর্ম নম্বর (5) য়ৌগনি।",
    origination:
      "(ন্যু দিল্লী) দগী (অমৃতসর) ফাওবা চৎলিবা ত্রেন নম্বর (12497), (শান-ই-পঞ্জাব এক্সপ্রেস) অসি প্লেতফোর্ম নম্বর (14) দগী চৎকনি।",
  },
  {
    additional: "ही गाडी (15:50) वर येईल आणि (15:55) वर (5) मिनिटांनंतर निघेल.",
    arrived:
      "कृपया मी तुमचे लक्ष वेधून घेऊ का, (नवी दिल्ली) ते (अमृतसर), (शान-ए-पंजाब एक्स्प्रेस) पर्यंतचा रेल्वे क्रमांक (12497) प्लॅटफॉर्म क्रमांकावर (8) नुकताच पोहोचला आहे.",
    arriving:
      "कृपया मी तुमचे लक्ष वेधून घेऊ का, (नवी दिल्ली) ते (अमृतसर) (शान-ए-पंजाब एक्स्प्रेस) हा रेल्वे क्रमांक (12497) लवकरच प्लॅटफॉर्म क्रमांकावर (8) येत आहे.",
    code: "mr",
    custom:
      "रेल्वे क्रमांक (13287), (दक्षिण बिहार एक्स्प्रेस), सध्या (30) मिनिटे विलंबित आहे. ती प्लॅटफॉर्म क्रमांक (1) वर (19:00) वर (टाटानगर जंक्शन) येथे (15) मिनिटांच्या नियोजित थांब्याने पोहोचणे अपेक्षित आहे.",
    late: "कृपया मी तुमचे लक्ष वेधून घेऊ का, (नवी दिल्ली) ते (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) पर्यंतचा रेल्वे क्रमांक (12497), निर्धारित वेळेपासून (5) तास आणि (25) मिनिटे उशिराने धावत आहे आणि प्लॅटफॉर्म क्रमांक (4) वर (20:00) पोहोचणे अपेक्षित आहे.",
    ontime:
      "कृपया मी तुमचे लक्ष वेधून घेऊ का, (नवी दिल्ली) ते (अमृतसर) (शान-ए-पंजाब एक्स्प्रेस) पर्यंतचा रेल्वे क्रमांक (12497) नियोजित वेळापत्रकानुसार धावत आहे, ही रेल्वेगाडी नियोजित वेळेनुसार (17:00) प्लॅटफॉर्म क्रमांक (5) वर पोहोचेल.",
    origination:
      "कृपया मी तुमचे लक्ष वेधून घेऊ का, (नवी दिल्ली) ते (अमृतसर) (शान-ए-पंजाब एक्स्प्रेस) पर्यंतचा रेल्वे क्रमांक (12497) प्लॅटफॉर्म क्रमांकावरून (14) निघणार आहे.",
  },
  {
    additional:
      "यो रेल (15:50) मा आइपुग्नेछ र (15:55) मा (5) मिनेट पछि प्रस्थान गर्नेछ।",
    arrived:
      "कृपया म तपाईँको ध्यान दिन सक्छु, रेल नम्बर (12497) (नयाँ दिल्ली) देखि (अमृतसर), (शान-ए-पन्जाब एक्सप्रेस) भर्खरै प्लेटफर्म नम्बर (8) मा आइपुगेको छ।",
    arriving:
      "कृपया तपाईँको ध्यान दिनुहोस्, रेल नम्बर (12497) (नयाँ दिल्ली) देखि (अमृतसर), (शान-ए-पन्जाब एक्सप्रेस) प्लेटफर्म नम्बर (8) मा चाँडै आउँदैछ।",
    code: "ne",
    custom: '्रेन नम्बर (13287), (दक्षिण बिहार एक्सप्रेस), हाल (30) मिनेट ढिलो भएको छ। यो प्लेटफर्म नम्बर (1) मा (19:00) (15) मिनेटको निर्धारित स्टपको साथ (टाटानगर जङ्सन) मा पुग्ने अपेक्षा गरिएको छ।',
    late: "कृपया म तपाईँको ध्यान दिन सक्छु, रेल नम्बर (12497) (नयाँ दिल्ली) देखि (अमृतसर), (शान-ए-पन्जाब एक्सप्रेस), निर्धारित समयबाट (5) घण्टा र (25) मिनेट ढिलो चलिरहेको छ, र प्लेटफर्म नम्बर (4) मा (20:00) मा पुग्ने अपेक्षा गरिएको छ।",
    ontime:
      "के म तपाईँको ध्यान दिन सक्छु, रेल नम्बर (12497) (नयाँ दिल्ली) देखि (अमृतसर), (शान-ए-पन्जाब एक्सप्रेस), निर्धारित समय अनुसार चलिरहेको छ, यो रेल प्लेटफर्म नम्बर (5) मा आफ्नो निर्धारित समयमा (17:00) पुग्नेछ।",
    origination:
      "कृपया तपाईँको ध्यान दिनुहोस्, रेल नम्बर (12497) (नयाँ दिल्ली) बाट (अमृतसर), (शान-ए-पन्जाब एक्सप्रेस) प्लेटफर्म नम्बर (14) बाट प्रस्थान गर्न लागेको छ।",
  },
  {
    additional:
      "ଏହି ଟ୍ରେନ୍ (15:50) ରେ ପହଞ୍ଚିବ ଏବଂ (15:55) ରେ (5) ମିନିଟ୍ ପରେ ପ୍ରସ୍ଥାନ କରିବ।",
    arrived:
      "ଦଯ଼ାକରି ମୁଁ ଆପଣଙ୍କ ଧ୍ଯ଼ାନ ଆକର୍ଷଣ କରିବି, ଟ୍ରେନ୍ ନମ୍ବର (12497) (ନୂଆଦିଲ୍ଲୀ) ରୁ (ଅମୃତସର), (ଶାନ୍-ଏ-ପଞ୍ଜାବ ଏକ୍ସପ୍ରେସ୍) ବର୍ତ୍ତମାନ ପ୍ଲାଟଫର୍ମ ନମ୍ବର (8) ରେ ପହଞ୍ଚିଛି।",
    arriving:
      "ଦଯ଼ାକରି ମୁଁ ଆପଣଙ୍କ ଧ୍ଯ଼ାନ ଆକର୍ଷଣ କରିବି, ଟ୍ରେନ୍ ନମ୍ବର (12497) (ନୂଆଦିଲ୍ଲୀ) ରୁ (ଅମୃତସର), (ଶାନ୍-ଏ-ପଞ୍ଜାବ ଏକ୍ସପ୍ରେସ୍) ଖୁବ୍ ଶୀଘ୍ର ପ୍ଲାଟଫର୍ମ ନମ୍ବର (8) ରେ ପହଞ୍ଚୁଛି।",
    code: "or",
    custom: 'ଟ୍ରେନ୍ ନମ୍ବର (13287), (ଦକ୍ଷିଣ ବିହାର ଏକ୍ସପ୍ରେସ୍), ବର୍ତ୍ତମାନ (30) ମିନିଟ୍ ବିଳମ୍ବ ହୋଇଛି। ଏହା ପ୍ଲାଟଫର୍ମ ନମ୍ବର (1) ରେ (19:00) (ଟାଟାନଗର ଜଙ୍କସନ) ରେ (15) ମିନିଟର ନିର୍ଦ୍ଧାରିତ ଷ୍ଟପ୍ ସହିତ ପହଞ୍ଚିବ ବୋଲି ଆଶା କରାଯାଉଛି।',
    late: "ଦଯ଼ାକରି ମୁଁ ଆପଣଙ୍କ ଧ୍ଯ଼ାନ ଆକର୍ଷଣ କରିବି କି, ଟ୍ରେନ୍ ନମ୍ବର (12497) (ନୂଆଦିଲ୍ଲୀ) ରୁ (ଅମୃତସର), (ଶାନ୍-ଏ-ପଞ୍ଜାବ ଏକ୍ସପ୍ରେସ୍), ନିର୍ଦ୍ଧାରିତ ସମଯ଼ଠାରୁ (5) ଘଣ୍ଟା ଏବଂ (25) ମିନିଟ୍ ବିଳମ୍ବରେ ଚାଲୁଛି, ଏବଂ ପ୍ଲାଟଫର୍ମ ନମ୍ବର (4) ରେ (20:00) ପହଞ୍ଚିବ ବୋଲି ଆଶା କରାଯାଉଛି।",
    ontime:
      "ଦଯ଼ାକରି ମୁଁ ଆପଣଙ୍କ ଧ୍ଯ଼ାନ ଆକର୍ଷଣ କରିବି, ଟ୍ରେନ୍ ନମ୍ବର (12497) (ନୂଆଦିଲ୍ଲୀ) ରୁ (ଅମୃତସର), (ଶାନ୍-ଏ-ପଞ୍ଜାବ ଏକ୍ସପ୍ରେସ୍), ନିର୍ଦ୍ଧାରିତ ସମଯ଼ ଅନୁଯାଯ଼ୀ ଚାଲୁଛି, ଏହି ଟ୍ରେନ୍ ନିର୍ଦ୍ଧାରିତ ସମଯ଼ରେ (17:00) ପ୍ଲାଟଫର୍ମ ନମ୍ବର (5) ରେ ପହଞ୍ଚିବ।",
    origination:
      "ଦଯ଼ାକରି ମୁଁ ଆପଣଙ୍କ ଧ୍ଯ଼ାନ ଆକର୍ଷଣ କରିବି, ଟ୍ରେନ୍ ନମ୍ବର (12497) (ନୂଆଦିଲ୍ଲୀ) ରୁ (ଅମୃତସର), (ଶାନ୍-ଏ-ପଞ୍ଜାବ ଏକ୍ସପ୍ରେସ୍) ପ୍ଲାଟଫର୍ମ ନମ୍ବର (14) ରୁ ପ୍ରସ୍ଥାନ କରିବାକୁ ଯାଉଛି।",
  },
  {
    additional:
      "ਇਹ ਰੇਲਗੱਡੀ (15:50) ਉੱਤੇ ਪਹੁੰਚੇਗੀ ਅਤੇ (15:55) ਉੱਤੇ (5) ਮਿੰਟ ਬਾਅਦ ਰਵਾਨਾ ਹੋਵੇਗੀ।",
    arrived:
      "ਕ੍ਰਿਪਾ ਕਰਕੇ ਮੈਂ ਤੁਹਾਡਾ ਧਿਆਨ ਦਿਵਾ ਸਕਦਾ ਹਾਂ, (ਨਵੀਂ ਦਿੱਲੀ) ਤੋਂ (ਅੰਮ੍ਰਿਤਸਰ) ਜਾਣ ਵਾਲੀ ਰੇਲਗੱਡੀ ਨੰਬਰ (12497), (ਸ਼ਾਨ-ਏ-ਪੰਜਾਬ ਐਕਸਪ੍ਰੈੱਸ) ਪਲੇਟਫਾਰਮ ਨੰਬਰ (8) 'ਤੇ ਪਹੁੰਚੀ ਹੈ।",
    arriving:
      "ਕ੍ਰਿਪਾ ਕਰਕੇ ਮੈਂ ਤੁਹਾਡਾ ਧਿਆਨ ਦਿਵਾ ਸਕਦਾ ਹਾਂ ਕਿ (ਨਵੀਂ ਦਿੱਲੀ) ਤੋਂ (ਅੰਮ੍ਰਿਤਸਰ) ਜਾਣ ਵਾਲੀ ਰੇਲਗੱਡੀ ਨੰਬਰ (12497), (ਸ਼ਾਨ-ਏ-ਪੰਜਾਬ ਐਕਸਪ੍ਰੈੱਸ) ਜਲਦੀ ਹੀ ਪਲੇਟਫਾਰਮ ਨੰਬਰ (8) 'ਤੇ ਪਹੁੰਚ ਰਹੀ ਹੈ।",
    code: "pa",
    custom:
      "ਟ੍ਰੇਨ ਨੰਬਰ (13287), (ਦੱਖਣੀ ਬਿਹਾਰ ਐਕਸਪ੍ਰੈਸ), ਇਸ ਵੇਲੇ (30) ਮਿੰਟ ਦੇਰੀ ਨਾਲ ਚੱਲ ਰਹੀ ਹੈ। ਇਸ ਦੇ (15) ਮਿੰਟ ਦੇ ਨਿਰਧਾਰਤ ਰੁਕਣ ਦੇ ਨਾਲ (19:00) ਪਲੇਟਫਾਰਮ ਨੰਬਰ (1) ਉੱਤੇ (ਟਾਟਾਨਗਰ ਜੰਕਸ਼ਨ) ਪਹੁੰਚਣ ਦੀ ਉਮੀਦ ਹੈ।",
    late: "ਕ੍ਰਿਪਾ ਕਰਕੇ ਮੈਂ ਤੁਹਾਡਾ ਧਿਆਨ ਦਿਵਾ ਸਕਦਾ ਹਾਂ ਕਿ (ਨਵੀਂ ਦਿੱਲੀ) ਤੋਂ (ਅੰਮ੍ਰਿਤਸਰ) ਜਾਣ ਵਾਲੀ ਰੇਲਗੱਡੀ ਨੰਬਰ (12497), (ਸ਼ਾਨ-ਏ-ਪੰਜਾਬ ਐਕਸਪ੍ਰੈੱਸ) ਆਪਣੇ ਨਿਰਧਾਰਤ ਸਮੇਂ ਤੋਂ (5) ਘੰਟੇ ਅਤੇ (25) ਮਿੰਟ ਦੇਰੀ ਨਾਲ ਚੱਲ ਰਹੀ ਹੈ ਅਤੇ ਪਲੇਟਫਾਰਮ ਨੰਬਰ (4) 'ਤੇ (20:00)' ਤੇ ਪਹੁੰਚਣ ਦੀ ਉਮੀਦ ਹੈ।",
    ontime:
      "ਕ੍ਰਿਪਾ ਕਰਕੇ ਮੈਂ ਤੁਹਾਡਾ ਧਿਆਨ ਦਿਵਾ ਸਕਦਾ ਹਾਂ ਕਿ (ਨਵੀਂ ਦਿੱਲੀ) ਤੋਂ (ਅੰਮ੍ਰਿਤਸਰ) ਜਾਣ ਵਾਲੀ ਰੇਲਗੱਡੀ ਨੰਬਰ (12497), (ਸ਼ਾਨ-ਏ-ਪੰਜਾਬ ਐਕਸਪ੍ਰੈੱਸ) ਨਿਰਧਾਰਤ ਸਮੇਂ ਅਨੁਸਾਰ ਚੱਲ ਰਹੀ ਹੈ, ਇਹ ਰੇਲਗੱਡੀ ਆਪਣੇ ਨਿਰਧਾਰਤ ਸਮੇਂ (17:00) 'ਤੇ ਪਲੇਟਫਾਰਮ ਨੰਬਰ (5)' ਤੇ ਪਹੁੰਚ ਜਾਵੇਗੀ।",
    origination:
      "ਕ੍ਰਿਪਾ ਕਰਕੇ ਮੈਂ ਤੁਹਾਡਾ ਧਿਆਨ ਦਿਵਾ ਸਕਦਾ ਹਾਂ ਕਿ ਰੇਲਗੱਡੀ ਨੰਬਰ (12497) (ਨਵੀਂ ਦਿੱਲੀ) ਤੋਂ (ਅੰਮ੍ਰਿਤਸਰ), (ਸ਼ਾਨ-ਏ-ਪੰਜਾਬ ਐਕਸਪ੍ਰੈਸ) ਪਲੇਟਫਾਰਮ ਨੰਬਰ (14) ਤੋਂ ਰਵਾਨਾ ਹੋਣ ਵਾਲੀ ਹੈ।",
  },
  {
    additional:
      "इयं रेलगाडी (15:50) मध्ये आगमिष्यति, (5) निमेषानन्तरं (15:55) निर्गमिष्यति।",
    arrived:
      "कृपया भवतः अवधानं प्राप्तुं शक्नोमि, रेलयानसङ्ख्या (12497) (नवदेहली) तः (अमृतसर्) पर्यन्तं, (शान्-ए-पञ्जाब् एक्स्प्रेस्) अधुना एव प्ल्याट्फ़ार्म्-सङ्ख्यायां (8) आगतम्।",
    arriving:
      "कृपया भवतः अवधानं प्राप्तुं शक्नोमि, (नवदेहली) तः (अमृतसर्) पर्यन्तं (शान्-ए-पञ्जाब् एक्स्प्रेस्) रेलयानसङ्ख्या (12497) शीघ्रमेव प्ल्याट्फ़ार्म्-सङ्ख्यायां (8) आगमिष्यति।",
    code: "sa",
    custom:
      "रेल्-सङ्ख्या (13287), (दक्षिण-बिहार-एक्स्प्रेस्), सम्प्रति (30) निमेषान् यावत् विलम्बिता अस्ति। प्ल्याट्फ़ार्म्-सङ्ख्यायां (1) इत्यत्र (19:00) (15) निमेषेषु नियत-विरामेन सह (टाटानगर-जङ्क्शन्) आगच्छति इति अपेक्ष्यते।",
    late: "(नवदेहली) तः (अमृत्सर्) पर्यन्तं (शान्-ए-पञ्जाब् एक्स्प्रेस्) रेलयानसङ्ख्या (12497), निर्धारितसमयात् (5) घण्टाः (25) निमेषाः विलम्बेन प्रचलति, तथा च प्ल्याट्फ़ार्म् सङ्ख्या (4) इत्यत्र (20:00) आगच्छति इति अपेक्ष्यते।",
    ontime:
      "(नवदेहली) तः (अमृत्सर्) पर्यन्तं (शान्-ए-पञ्जाब् एक्स्प्रेस्) रेलयानसङ्ख्या (12497) पूर्वनिर्धारितरूपेण प्रचलति, एषा रेलगाडी स्वस्य निर्धारितसमये (17:00) प्ल्याट्फ़ार्म् सङ्ख्या (5) प्राप्स्यति।",
    origination:
      "कृपया भवतः अवधानं प्राप्तुं शक्नोमि, रेलयानसङ्ख्या (12497) (नवदेहली) तः (अमृत्सर्) पर्यन्तं, (शान्-ए-पञ्जाब् एक्स्प्रेस्) प्ल्याट्फ़ार्म् सङ्ख्या (14) इत्यतः निर्गमिष्यति।",
  },
  {
    additional:
      "ᱱᱚᱶᱟ ᱴᱮᱨᱮᱱ ᱫᱚ (15:50) ᱨᱮ ᱥᱮᱴᱮᱨᱚᱜᱼᱟ ᱟᱨ (5) ᱴᱤᱲᱤᱡ ᱛᱟᱭᱚᱢ (15:55) ᱨᱮ ᱪᱟᱞᱟᱣᱚᱜᱼᱟ ᱾",
    arrived:
      "ᱤᱧ ᱠᱤ ᱫᱟᱭᱟ ᱠᱟᱛᱮ ᱟᱢᱟᱜ ᱢᱚᱱᱮ ᱮᱢᱢᱮ, ᱴᱮᱨᱮᱱ ᱱᱚᱢᱵᱚᱨ (12497) (ᱱᱟᱶᱟ ᱫᱤᱞᱞᱤ) ᱠᱷᱚᱱ (ᱚᱢᱨᱤᱛᱥᱚᱨ) ᱦᱟᱹᱵᱤᱡ, (ᱥᱟᱱᱼᱮᱼᱯᱩᱧᱡᱚᱵ ᱮᱠᱥᱯᱨᱮᱥ) ᱥᱴᱞᱟᱴᱯᱷᱳᱨᱟᱢ ᱱᱚᱢᱵᱚᱨ (8) ᱨᱮ ᱥᱮᱴᱮᱨ ᱟᱠᱟᱱᱟ ᱾",
    arriving:
      "ᱤᱧ ᱠᱤ ᱫᱟᱭᱟ ᱠᱟᱛᱮ ᱟᱢᱟᱜ ᱢᱚᱱᱮ ᱮᱢᱢᱮ, ᱴᱮᱨᱮᱱ ᱱᱚᱢᱵᱚᱨ (12497) (ᱱᱟᱶᱟ ᱫᱤᱞᱞᱤ) ᱠᱷᱚᱱ (ᱚᱢᱨᱤᱛᱥᱚᱨ), (ᱥᱟᱱᱼᱮᱼᱯᱩᱧᱡᱚᱵ ᱮᱠᱥᱯᱨᱮᱥ) ᱟᱹᱰᱤ ᱠᱚᱢ ᱚᱠᱛᱚ ᱨᱮ ᱯᱷᱚᱞᱴᱯᱷᱳᱨᱟᱢ ᱱᱚᱢᱵᱚᱨ (8) ᱨᱮ ᱥᱮᱴᱮᱨᱚᱜᱼᱟ ᱾",
    code: "sat",
    custom: 'ᱴᱮᱨᱮᱱ ᱱᱚᱢᱵᱚᱨ (13287), (ᱫᱚᱠᱷᱤᱱ ᱵᱤᱦᱟᱨ ᱮᱠᱥᱯᱨᱮᱥ), ᱱᱟᱦᱟᱜ (30) ᱴᱤᱲᱤᱡ ᱛᱟᱭᱚᱢ ᱟᱠᱟᱱᱟ ᱾ ᱱᱚᱶᱟ ᱫᱚ (15) ᱴᱤᱲᱤᱡ ᱚᱠᱛᱚ ᱞᱟᱹᱜᱤᱫ ᱵᱚᱱᱚᱫᱚᱞ ᱥᱟᱶᱛᱮ (1) ᱱᱚᱢᱵᱚᱨ (19:00) ᱨᱮ (ᱛᱚᱛᱟᱱᱜᱚᱨ ᱡᱳᱝᱥᱚᱱ) ᱥᱮᱴᱮᱨᱚᱜᱼᱟ ᱢᱮᱱᱛᱮ ᱢᱚᱱᱮ ᱦᱩᱭᱩᱜ ᱠᱟᱱᱟ ᱾',
    late: "ᱤᱧ ᱠᱤ ᱫᱟᱭᱟ ᱠᱟᱛᱮ ᱟᱢᱟᱜ ᱢᱚᱱᱮ ᱮᱢᱢᱮ, ᱴᱮᱨᱮᱱ ᱱᱚᱢᱵᱚᱨ (12497) (ᱱᱟᱶᱟ ᱫᱤᱞᱞᱤ) ᱠᱷᱚᱱ (ᱚᱢᱨᱤᱛᱥᱚᱨ), (ᱥᱟᱱᱼᱮᱼᱯᱩᱧᱡᱚᱵ ᱮᱠᱥᱯᱨᱮᱥ), ᱜᱚᱴᱟ ᱟᱠᱟᱱ ᱚᱠᱛᱚ ᱠᱷᱚᱱ (5) ᱴᱟᱲᱟᱝ ᱟᱨ (25) ᱴᱤᱲᱤᱡ ᱛᱮ ᱪᱟᱞᱟᱣ ᱟᱠᱟᱱᱟ, ᱟᱨ ᱯᱷᱚᱞᱴᱯᱷᱳᱨᱟᱢ ᱱᱚᱢᱵᱚᱨ (4) ᱨᱮ (20:00) ᱨᱮ ᱥᱮᱴᱮᱨᱚᱜᱼᱟ ᱢᱮᱱᱛᱮ ᱢᱚᱱᱮ ᱦᱩᱭᱩᱜ ᱠᱟᱱᱟ ᱾",
    ontime:
      "ᱤᱧ ᱠᱤ ᱫᱟᱭᱟ ᱠᱟᱛᱮ ᱟᱢᱟᱜ ᱢᱚᱱᱮ ᱮᱢᱢᱮ, ᱴᱮᱨᱮᱱ ᱱᱚᱢᱵᱚᱨ (12497) (ᱱᱟᱶᱟ ᱫᱤᱞᱞᱤ) ᱠᱷᱚᱱ (ᱚᱢᱨᱤᱛᱥᱚᱨ), (ᱥᱟᱱᱼᱮᱼᱯᱩᱧᱡᱚᱵ ᱮᱠᱥᱯᱨᱮᱥ), ᱛᱟᱹᱞᱤᱠᱟ ᱞᱮᱠᱟᱛᱮ ᱪᱟᱞᱟᱣᱚᱜ ᱠᱟᱱᱟ, ᱱᱚᱶᱟ ᱴᱮᱨᱮᱱ ᱫᱚ ᱚᱱᱟ ᱛᱟᱹᱞᱤᱠᱟ ᱚᱠᱛᱚ (17:00) ᱯᱮᱴᱨᱟᱢ ᱱᱚᱢᱵᱚᱨ (5) ᱨᱮ ᱥᱮᱴᱮᱨᱚᱜᱼᱟ ᱾",
    origination:
      "ᱤᱧ ᱠᱤ ᱫᱟᱭᱟ ᱠᱟᱛᱮ ᱟᱢᱟᱜ ᱢᱚᱱᱮ ᱮᱢᱢᱮ, ᱴᱮᱨᱮᱱ ᱱᱚᱢᱵᱚᱨ (12497) (ᱱᱟᱶᱟ ᱫᱤᱞᱞᱤ) ᱠᱷᱚᱱ (ᱚᱢᱨᱤᱛᱥᱚᱨ), (ᱥᱟᱱᱼᱮᱼᱯᱩᱧᱡᱚᱵ ᱮᱠᱥᱯᱨᱮᱥ) ᱯᱷᱞᱟᱴᱯᱷᱳᱨᱟᱢ ᱱᱚᱢᱵᱚᱨ (14) ᱠᱷᱚᱱ ᱪᱟᱞᱟᱣᱚᱜ ᱠᱟᱱᱟ ᱾",
  },
  {
    additional:
      "ہی ٽرین (15:50) تی ایندی ۽ (5) منٽن کان پوء (15:55) تی روانگی ٿیندی",
    arrived:
      "ڇا مان توہان جو ڌیان ڏیندس، ٽرین نمبر (12497) (نئین دہلی) کان (امرتسر)، (شان-ای-پنجاب ایڪسپریس) بس پلیٽ فارم نمبر (8) تی پہتو",
    arriving:
      "مہربانی ڪری مان توہان جو ڌیان ڏیندس، ٽرین نمبر (12497) (نئین دہلی) کان (امرتسر)، (شان-ای-پنجاب ایڪسپریس) جلد ئی پلیٽ فارم نمبر (8) تی اچی رھیو آھی",
    code: "sd",
    custom: 'ٽرین نمبر (13287)، (ڏکڻ بہار ایڪسپریس)، ھن وقت (30) منٽ دیر آھی ان جی (15) منٽن جی مقرر ڪیل اسٽاپ سان پلیٽ فارم نمبر (1) تی (19:00) تی (ٽاٽانگر جنڪشن) تی پھچڻ جی امید آھی',
    late: "ڇا مان توہان جو ڌیان ڏیندس، ٽرین نمبر (12497) (نئین دہلی) کان (امرتسر)، (شان-ای-پنجاب ایڪسپریس)، پنھنجی مقرر وقت کان (5) ڪلاڪ ۽ (25) منٽ دیر سان ھلندی آھی، ۽ پلیٽ فارم نمبر (4) تی (20:00) تی پھچڻ جی امید آھی",
    ontime:
      "ڇا مان توہان جو ڌیان ڏیندس، ٽرین نمبر (12497) (نئین دہلی) کان (امرتسر)، (شان-ای-پنجاب ایڪسپریس)، مقرر وقت مطابق ہلی رہی آھی، ہی ٽرین پلیٽ فارم نمبر (5) تی پنھنجی مقرر وقت تی پہچی ویندی (17:00)",
    origination:
      "ڇا مان توہان جو ڌیان ڏیندس، ٽرین نمبر (12497) (نئین دہلی) کان (امرتسر)، (شان-ای-پنجاب ایڪسپریس) پلیٽ فارم نمبر (14) کان روانگی ٿیڻ واری آھی",
  },

  {
    additional:
      "ही ट्रेन (15:50) ते पहुचंदो ऐं (5) मिनटनि खां पोइ (15:55) ते रवाना थींदो",
    arrived:
      "कृपा करे मां तवहां जो ध्यान दयां, ट्रेन जो नम्बरु (12497) (नईं दिल्ली खां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफार्म नम्बरु (8) ते ई पहुची आहे।",
    arriving:
      "कृपा करे मां तवहां जो ध्यान दयां, रेल नंबर (12497) (नईं दिल्ली) खां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफ़ार्म नंबर (8) ते जल्दी ई पहुची रही आहे।",
    code: "sd_Deva",
    custom:
      "ट्रेन जो नम्बरु (13287), (ॾिखणु बिहार एक्सप्रेस), हिन वक़्त (30) मिनट जी देरी आहे हुन जे प्लेटफार्म नंबर (1) ते (19:00) ते (15) मिनट जे नियत रुकणु सां गडु॒ (टाटानगर जंक्शन) ते पहुचणु जी आस आहे",
    late: "कृपा करे मां तवहां जो ध्यान दयां, ट्रेन नंबर (12497) (नई दिल्ली) खां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस), पंहिंजे तय वक़्त खां (5) घंटो ऐं (25) मिनट देरि थी रही आहे, ऐं प्लेटफार्म नंबर (4) ते (20:00) ते पहुचणु जी उम्मीद आहे।",
    ontime:
      "कृपा करे मां तवहां जो ध्यान दयां, ट्रेन नंबर (12497) (नई दिल्ली) खां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस), तय वक़्त ते हलंदो आहे, ही ट्रेन प्लेटफार्म नंबर (5) ते पंहिंजे तय वक़्त ते पहुचंदो (17:00)",
    origination:
      "कृपा करे मां तवहां जो ध्यान दयां, ट्रेन नंबर (12497) (नईं दिल्ली) खां (अमृतसर), (शान-ए-पंजाब एक्सप्रेस) प्लेटफार्म नंबर (14) खां रवानगीअ वारी आहे।",
  },
  {
    additional:
      "இந்த ரயில் (15:50) வந்து (15:55) மணிக்கு (5) நிமிடங்களுக்குப் பிறகு புறப்படும்.",
    arrived:
      "(புது தில்லி) முதல் (அமிர்தசரஸ்) வரையிலான ரயில் எண் (12497), (ஷான்-இ-பஞ்சாப் எக்ஸ்பிரஸ்) இப்போதுதான் பிளாட்பார்ம் எண் (8) இல் வந்தது.",
    arriving:
      "(புது தில்லி) முதல் (அமிர்தசரஸ்) வரையிலான ரயில் எண் (12497), (ஷான்-இ-பஞ்சாப் எக்ஸ்பிரஸ்) விரைவில் பிளாட்பார்ம் எண் (8) இல் வருகிறது.",
    code: "ta",
    custom:
      "ரயில் எண் (13287), (தெற்கு பீகார் எக்ஸ்பிரஸ்), தற்போது (30) நிமிடங்கள் தாமதமாக உள்ளது. இது (15) நிமிடங்கள் திட்டமிடப்பட்ட நிறுத்தத்துடன் (19:00) இயங்குதளம் எண் (1) இல் (டாடாநகர் சந்திப்பு) வரும் என்று எதிர்பார்க்கப்படுகிறது.",
    late: "(புது தில்லி) முதல் (அமிர்தசரஸ்) வரையிலான ரயில் எண் (12497), (ஷான்-இ-பஞ்சாப் எக்ஸ்பிரஸ்), அதன் திட்டமிடப்பட்ட நேரத்திலிருந்து (5) மணி நேரம் மற்றும் (25) நிமிடங்கள் தாமதமாக இயங்குகிறது, மேலும் பிளாட்பார்ம் எண் (4) இல் (20:00) வரும் என்று எதிர்பார்க்கப்படுகிறது.",
    ontime:
      "(புது தில்லி) முதல் (அமிர்தசரஸ்) வரையிலான ரயில் எண் (12497), (ஷான்-இ-பஞ்சாப் எக்ஸ்பிரஸ்), திட்டமிட்டபடி இயங்குகிறது, இந்த ரயில் அதன் திட்டமிடப்பட்ட நேரத்தில் (17:00) பிளாட்பார்ம் எண் (5) ஐ அடையும்.",
    origination:
      "(புது தில்லி) முதல் (அமிர்தசரஸ்) வரையிலான ரயில் எண் (12497), (ஷான்-இ-பஞ்சாப் எக்ஸ்பிரஸ்) பிளாட்பார்ம் எண் (14) இலிருந்து புறப்பட உள்ளது.",
  },
  {
    additional:
      "ఈ రైలు (15:50) లో వచ్చి (15:55) వద్ద (5) నిమిషాల తర్వాత బయలుదేరుతుంది.",
    arrived:
      "(న్యూ ఢిల్లీ) నుండి (అమృత్సర్), (షాన్-ఎ-పంజాబ్ ఎక్స్ప్రెస్) వరకు ఉన్న రైలు సంఖ్య (12497) ప్లాట్ఫాం సంఖ్య (8) లో ఇప్పుడే వచ్చింది.",
    arriving:
      "దయచేసి నేను మీ దృష్టిని ఆకర్షించగలనా, (న్యూ ఢిల్లీ) నుండి (అమృత్సర్) వరకు (షాన్-ఎ-పంజాబ్ ఎక్స్ప్రెస్) రైలు నంబర్ (12497) ప్లాట్ఫాం నంబర్ (8) లో త్వరలో వస్తోంది.",
    code: "te",
    custom: 'రైలు సంఖ్య (13287), (దక్షిణ బీహార్ ఎక్స్ప్రెస్), ప్రస్తుతం (30) నిమిషాలు ఆలస్యంగా నడుస్తోంది. ఇది (15) నిమిషాల నిర్ణీత విరామంతో ప్లాట్ఫాం నంబర్ (1) వద్ద (19:00) (టాటానగర్ జంక్షన్) చేరుకుంటుందని భావిస్తున్నారు.',
    late: "దయచేసి నేను మీ దృష్టిని ఆకర్షించగలనా, (న్యూ ఢిల్లీ) నుండి (అమృత్సర్), (షాన్-ఎ-పంజాబ్ ఎక్స్ప్రెస్) వరకు రైలు సంఖ్య (12497), దాని నిర్ణీత సమయం నుండి (5) గంటలు మరియు (25) నిమిషాలు ఆలస్యంగా నడుస్తోంది, మరియు ప్లాట్ఫాం నంబర్ (4) లో (20:00) చేరుకుంటుందని భావిస్తున్నారు.",
    ontime:
      "(న్యూ ఢిల్లీ) నుండి (అమృత్సర్), (షాన్-ఎ-పంజాబ్ ఎక్స్ప్రెస్) వరకు రైలు సంఖ్య (12497), షెడ్యూల్ ప్రకారం నడుస్తోంది, ఈ రైలు దాని షెడ్యూల్ సమయంలో (17:00) ప్లాట్ఫాం సంఖ్య (5) కి చేరుకుంటుంది.",
    origination:
      "దయచేసి నేను మీ దృష్టిని ఆకర్షించగలనా, రైలు సంఖ్య (12497) (న్యూఢిల్లీ) నుండి (అమృత్సర్), (షాన్-ఎ-పంజాబ్ ఎక్స్ప్రెస్) ప్లాట్ఫాం సంఖ్య (14) నుండి బయలుదేరబోతోంది.",
  },
  {
    additional:
      "یہ ٹرین (15:50) پر پہنچے گی اور (15:55) پر (5) منٹ کے بعد روانہ ہوگی۔",
    arrived:
      "کیا میں آپ کی توجہ حاصل کر سکتا ہوں، (نئی دہلی) سے (امرتسر) جانے والی ٹرین نمبر (12497)، (شان پنجاب ایکسپریس) ابھی پلیٹ فارم نمبر (8) پر پہنچی ہے۔",
    arriving:
      "کیا میں آپ کی توجہ حاصل کر سکتا ہوں، (نئی دہلی) سے (امرتسر) جانے والی ٹرین نمبر (12497)، (شان پنجاب ایکسپریس) پلیٹ فارم نمبر (8) پر جلد ہی پہنچ رہی ہے۔",
    code: "ur",
    custom: 'ٹرین نمبر (13287)، (ساؤتھ بہار ایکسپریس)، فی الحال (30) منٹ کی تاخیر سے چل رہی ہے۔ اس کے پلیٹ فارم نمبر (1) پر (19:00) (15) منٹ کے مقررہ اسٹاپ کے ساتھ (ٹاٹا نگر جنکشن) پہنچنے کی توقع ہے۔',
    late: "کیا میں آپ کی توجہ دلا سکتا ہوں، (نئی دہلی) سے (امرتسر) جانے والی ٹرین نمبر (12497)، (شان پنجاب ایکسپریس)، اپنے مقررہ وقت سے (5) گھنٹے اور (25) منٹ تاخیر سے چل رہی ہے، اور پلیٹ فارم نمبر (4) پر (20:00) پر پہنچنے کی توقع ہے۔",
    ontime:
      "کیا میں آپ کی توجہ دلا سکتا ہوں، (نئی دہلی) سے (امرتسر) جانے والی ٹرین نمبر (12497)، (شان پنجاب ایکسپریس)، مقررہ وقت کے مطابق چل رہی ہے، یہ ٹرین اپنے مقررہ وقت پر (17:00) پلیٹ فارم نمبر (5) تک پہنچ جائے گی۔",
    origination:
      "براہ کرم میں آپ کی توجہ دلاؤں، ٹرین نمبر (12497) (نئی دہلی) سے (امرتسر)، (شان پنجاب ایکسپریس) پلیٹ فارم نمبر (14) سے روانہ ہونے والی ہے۔",
  },
];

//ASR Language Configs
const ASR_LANGUAGE_CONFIGS = {
  streaming: "bn,en,gu,hi,kn,ml,mr,ne,or,pa,sa,si,ta,te,ur".split(","),
  rest: "bn,en,gu,hi,kn,ml,mr,ne,or,pa,sa,si,ta,te,ur".split(","),
  processors: {
    hi: {
      numbers_only: [true, "Numbers Only"],
    },
    mr: {
      numbers_only: [true, "Numbers Only"],
    },
  },
};

export {
  ASR_LANGUAGE_CONFIGS,
  SPEECH_TO_TEXT,
  TEXT_TO_SPEECH,
  TRANSLATION,
  PREDEFINED_ANNOUNCEMENT,
  LANGUAGE_SELECTION,
};
